-- Напишете заявка, която извежда името на класа и страната за всички
-- класове с брой на оръдията по-малък от 10
-- select CLASS, COUNTRY
-- from CLASSES
-- where NUMGUNS < 10

-- Напишете заявка, която извежда имената на всички кораби, пуснати на
-- вода преди 1918. Задайте псевдоним на колоната shipName
-- select NAME as shipName
-- from SHIPS
-- where LAUNCHED < 1918

-- Напишете заявка, която извежда имената на корабите потънали в битка
-- и имената на битките в които са потънали
-- select SHIP as SHIPNAME, BATTLE
-- from OUTCOMES
-- where RESULT = 'sunk'

-- Напишете заявка, която извежда имената на корабите с име съвпадащо
-- с името на техния клас
-- select NAME
-- from SHIPS
-- where NAME = CLASS

-- Напишете заявка, която извежда имената на всички кораби започващи с
-- буквата R
-- select NAME
-- from SHIPS
-- where NAME LIKE 'R%'

-- Напишете заявка, която извежда имената на всички кораби, чието име е
-- съставено от точно две думи.
-- select NAME
-- from SHIPS
-- where NAME LIKE '_% _%'