-- Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- всички компютри с цена по-малка от 1200 долара. Задайте псевдоними за
-- атрибутите честота и размер на диска, съответно MHz и GB
select MODEL, SPEED as MHz, HD as GB
from PC
where PRICE < 1200;

-- Напишете заявка, която извежда всички производители на принтери без
-- повторения
select distinct MAKER
from PRODUCT
where TYPE = 'Printer';

-- Напишете заявка, която извежда номер на модел, размер на паметта, размер на
-- екран за лаптопите, чиято цена е по-голяма от 1000 долара
select MODEL, RAM, SCREEN
from LAPTOP
where price > 1000;

-- Напишете заявка, която извежда всички цветни принтери
select *
from PRINTER
where COLOR = 'y';

-- Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- тези компютри с DVD 12x или 16x и цена по-малка от 2000 долара
select MODEL, SPEED, HD
from PC
where CD = '12x' or CD = '16x' and price < 2000;